Repository: banghuazhao/ai-prompts
Catalog: AIPrompts/Localizable.xcstrings
Source language: en
Languages: zh_hant

source: Suggestion: %@
zh_hant: 建議：%@

source: %@ - Upgrade to Premium
zh_hant: %@ - 升級至進階版

source: %lld characters
zh_hant: %lld 個字元

source: %lld new prompts added
zh_hant: 新增了 %lld 個提示詞

source: 1 new prompt added
zh_hant: 新增了 1 個提示詞

source: A one-time purchase. No subscription.
zh_hant: 一次購買，無需訂閱。

source: AI Prompts | AI Prompt Directory
zh_hant: AI 提示詞 | AI 提示詞大全

source: Act/Role (e.g., 'Act as a iOS Developer')
zh_hant: 角色（例如：「扮演 iOS 開發者」）

source: Activities
zh_hant: 活動

source: Ad-free experience
zh_hant: 無廣告體驗

source: Add Prompt
zh_hant: 新增提示詞

source: Add Vibe Prompt
zh_hant: 新增 Vibe 提示詞

source: Add a bit more context if needed.
zh_hant: 如有需要，請補充更多背景資訊。

source: Add a bit more detail to clarify your request.
zh_hant: 補充更多細節，讓需求更明確。

source: Add an example to clarify your request.
zh_hant: 加入範例，讓需求更清楚。

source: All
zh_hant: 全部

source: Animals
zh_hant: 動物

source: App Details
zh_hant: App 詳細資訊

source: App Name
zh_hant: App 名稱

source: Appearance
zh_hant: 外觀

source: Are you sure you want to delete %@? This action cannot be undone.
zh_hant: 確定要刪除「%@」嗎？此操作無法復原。

source: Audience
zh_hant: 目標讀者

source: Best Practices:
zh_hant: 最佳實踐：

source: Blue
zh_hant: 藍色

source: Break your instructions into steps or a list if possible.
zh_hant: 盡量將指示拆成步驟或清單。

source: By following these practices, you can craft prompts that are clear, effective, and more likely to yield the results you want from AI.
zh_hant: 遵循這些做法，就能寫出清楚、有效的提示詞，更容易從 AI 得到想要的結果。

source: Cancel
zh_hant: 取消

source: Categories
zh_hant: 分類

source: Category
zh_hant: 分類

source: Character Length ↑
zh_hant: 字元數 ↑

source: Character Length ↓
zh_hant: 字元數 ↓

source: Choose your avatar
zh_hant: 選擇你的頭像

source: Clarity
zh_hant: 清晰度

source: Clear
zh_hant: 清除

source: Close
zh_hant: 關閉

source: Completeness
zh_hant: 完整性

source: Conciseness
zh_hant: 簡潔度

source: Consider breaking complex tasks into steps.
zh_hant: 考慮將複雜任務拆成多個步驟。

source: Contact Support
zh_hant: 聯絡客服

source: Context Engineering
zh_hant: 情境工程

source: Context Engineering Tips
zh_hant: 情境工程小技巧

source: Context engineering is the art and science of providing just the right information to an AI model for the best results. It goes beyond simple prompt writing—focusing on how to structure, prune, and optimize all the information (context) you give to the model. By applying context engineering, you can make your prompts clearer, more effective, and more efficient.
zh_hant: 情境工程是一門為 AI 模型提供恰到好處資訊、以取得最佳結果的藝術與科學。它不只是撰寫提示詞，而是著重於如何組織、精簡並最佳化你提供給模型的所有資訊（情境）。善用情境工程，能讓你的提示詞更清楚、更有效，也更有效率。

source: Continue
zh_hant: 繼續

source: Contributor (optional)
zh_hant: 貢獻者（選填）

source: Copied “%@”. Paste it into your AI chat.
zh_hant: 已拷貝「%@」，貼到你的 AI 對話中即可使用。

source: Copied!
zh_hant: 已拷貝！

source: Copies a prompt to the clipboard so you can paste it into any AI chat.
zh_hant: 將提示詞拷貝到剪貼簿，方便貼到任何 AI 對話中。

source: Copy
zh_hant: 拷貝

source: Copy ${prompt}
zh_hant: 拷貝 ${prompt}

source: Copy Prompt
zh_hant: 拷貝提示詞

source: Customize & Use
zh_hant: 自訂並使用

source: Dark Mode
zh_hant: 深色模式

source: Default
zh_hant: 預設

source: Delete
zh_hant: 刪除

source: Delete Prompt
zh_hant: 刪除提示詞

source: Delete Vibe Prompt
zh_hant: 刪除 Vibe 提示詞

source: Done
zh_hant: 完成

source: E.g., 'Explain for a beginner'.
zh_hant: 例如：「用初學者能懂的方式解釋」。

source: E.g., 'Respond in JSON'.
zh_hant: 例如：「以 JSON 格式回覆」。

source: Edit
zh_hant: 編輯

source: Edit Prompt
zh_hant: 編輯提示詞

source: Edit Vibe Prompt
zh_hant: 編輯 Vibe 提示詞

source: Enter your GitHub username (e.g., banghuazhao, which will link to https://github.com/banghuazhao). Optional.
zh_hant: 輸入你的 GitHub 使用者名稱（例如 banghuazhao，將連結至 https://github.com/banghuazhao）。選填。

source: Example: Swift, SwiftUI, iOS. Optional.
zh_hant: 例如：Swift, SwiftUI, iOS。選填。

source: Examples
zh_hant: 範例

source: Favorite
zh_hant: 加入最愛

source: Favorites
zh_hant: 最愛

source: Favorites Only
zh_hant: 僅限最愛

source: Feedback
zh_hant: 意見回饋

source: Fill in %lld blanks before copying or launching
zh_hant: 拷貝或開啟前，先填寫 %lld 個空格

source: Fill in 1 blank before copying or launching
zh_hant: 拷貝或開啟前，先填寫 1 個空格

source: Fill in the blanks
zh_hant: 填空

source: Filter
zh_hant: 篩選

source: Filter by Tech Stack
zh_hant: 依技術棧篩選

source: Find prompts and vibe prompts by title, text, or tech stack.
zh_hant: 依標題、內容或技術棧搜尋提示詞與 Vibe 提示詞。

source: Food
zh_hant: 食物

source: For Developers
zh_hant: 適合開發者

source: For longer prompts, consider adding more details (who, what, how, when, where).
zh_hant: 較長的提示詞可考慮補充更多細節（誰、什麼、如何、何時、何地）。

source: For longer prompts, consider providing an example.
zh_hant: 較長的提示詞可考慮提供範例。

source: For longer prompts, consider specifying the desired output format.
zh_hant: 較長的提示詞可考慮指定想要的輸出格式。

source: For longer prompts, consider specifying the intended audience.
zh_hant: 較長的提示詞可考慮指定目標讀者。

source: Get Random Prompt
zh_hant: 取得隨機提示詞

source: Get a random prompt
zh_hant: 取得隨機提示詞

source: Go Premium
zh_hant: 升級進階版

source: Green
zh_hant: 綠色

source: How We Analyze Your Prompts:
zh_hant: 我們如何分析你的提示詞：

source: Improve Prompt
zh_hant: 改善提示詞

source: Instruction Type
zh_hant: 指令類型

source: Is for Developers
zh_hant: 適合開發者

source: Key Principles:
zh_hant: 核心原則：

source: Learn more: [Context-Engineering Handbook](https://github.com/davidkimai/Context-Engineering)
zh_hant: 了解更多：[Context-Engineering Handbook](https://github.com/davidkimai/Context-Engineering)

source: Leave a field empty to keep the original text.
zh_hant: 欄位留空則保留原文。

source: List the steps or details needed for the process.
zh_hant: 列出這個流程所需的步驟或細節。

source: Loading product...
zh_hant: 正在載入商品⋯

source: Long prompt could be easier to follow if broken into steps.
zh_hant: 較長的提示詞若拆成步驟會更容易理解。

source: Long prompt could benefit from more structure (steps, lists, etc.).
zh_hant: 較長的提示詞可以加入更多結構（步驟、清單等）。

source: Make your prompt a clear instruction or question.
zh_hant: 讓提示詞成為明確的指令或問題。

source: Modified Date
zh_hant: 修改日期

source: More
zh_hant: 更多

source: More Apps
zh_hant: 更多 App

source: More Features
zh_hant: 更多功能

source: NEW
zh_hant: 新

source: Neutrality
zh_hant: 中立性

source: New
zh_hant: 最新

source: New prompt
zh_hant: 新提示詞

source: No Ads
zh_hant: 無廣告

source: No Favorite Prompts
zh_hant: 沒有最愛的提示詞

source: No Favorite Vibe Prompts
zh_hant: 沒有最愛的 Vibe 提示詞

source: No banners and no full-screen ads when you come back to the app.
zh_hant: 沒有橫幅廣告，回到 App 時也不會出現全螢幕廣告。

source: No major issues detected. Your prompt looks good!
zh_hant: 沒有發現明顯問題，你的提示詞看起來很棒！

source: Note: When a category is deleted, all prompts in that category will be moved to '💬 All' category.
zh_hant: 注意：刪除分類後，該分類中的所有提示詞將移至「💬 全部」。

source: Objects
zh_hant: 物品

source: Open ${prompt}
zh_hant: 開啟 ${prompt}

source: Open Prompt
zh_hant: 開啟提示詞

source: Opens a prompt in AI Prompts.
zh_hant: 在 AI 提示詞中開啟提示詞。

source: Orange
zh_hant: 橘色

source: Others
zh_hant: 其他

source: Pay Once, Keep Forever
zh_hant: 買斷一次，永久使用

source: Picks a random prompt for inspiration and copies it to the clipboard.
zh_hant: 隨機挑選一個提示詞帶來靈感，並拷貝到剪貼簿。

source: Pink
zh_hant: 粉紅色

source: Please describe your issue below
zh_hant: 請在下方描述你遇到的問題

source: Preview
zh_hant: 預覽

source: Privacy Policy
zh_hant: 隱私權政策

source: Prompt
zh_hant: 提示詞

source: Prompt Creation
zh_hant: 建立提示詞

source: Prompt Details
zh_hant: 提示詞詳細資訊

source: Prompt Engineering
zh_hant: 提示詞工程

source: Prompt Engineering Best Practices
zh_hant: 提示詞工程最佳實踐

source: Prompt Improvement Suggestions
zh_hant: 提示詞改善建議

source: Prompt Text
zh_hant: 提示詞內容

source: Prompt asks for a process but does not specify steps.
zh_hant: 提示詞要求一個流程，但沒有說明步驟。

source: Prompt contains repeated sentences or phrases.
zh_hant: 提示詞包含重複的句子或片語。

source: Prompt contains several filler words (e.g., 'just', 'basically').
zh_hant: 提示詞包含多個贅字（例如「just」、「basically」）。

source: Prompt contains several leading or biased phrases.
zh_hant: 提示詞包含多個帶有引導或偏見的用語。

source: Prompt contains several vague words (e.g., 'things', 'something').
zh_hant: 提示詞包含多個模糊字詞（例如「things」、「something」）。

source: Prompt is very long. Consider shortening if possible.
zh_hant: 提示詞很長，可以的話請考慮精簡。

source: Prompt is very short and may be too generic.
zh_hant: 提示詞很短，可能太過籠統。

source: Prompt is very short and may not be a clear instruction or question.
zh_hant: 提示詞很短，可能不是明確的指令或問題。

source: Prompts
zh_hant: 提示詞

source: Prompts (%lld)
zh_hant: 提示詞（%lld）

source: Prompts and vibe prompts
zh_hant: 提示詞與 Vibe 提示詞

source: Prompts you favorite will appear here
zh_hant: 加入最愛的提示詞會顯示在這裡

source: Purple
zh_hant: 紫色

source: Quick Launch
zh_hant: 快速開啟

source: Quick launch to %@
zh_hant: 快速開啟 %@

source: Random Prompt
zh_hant: 隨機提示詞

source: Rate Us
zh_hant: 為我們評分

source: Redundancy
zh_hant: 重複性

source: Remove filler words for clarity.
zh_hant: 刪除贅字，讓內容更清楚。

source: Remove repeated instructions to keep your prompt focused.
zh_hant: 刪除重複的指示，讓提示詞更聚焦。

source: Remove unnecessary words for clarity.
zh_hant: 刪除不必要的字詞，讓內容更清楚。

source: Reset
zh_hant: 重設

source: Restore Purchases
zh_hant: 恢復購買

source: Save
zh_hant: 儲存

source: Search
zh_hant: 搜尋

source: Search Everything
zh_hant: 搜尋全部

source: Search prompts
zh_hant: 搜尋提示詞

source: Settings
zh_hant: 設定

source: Share App
zh_hant: 分享 App

source: Show Context Engineering Tips
zh_hant: 顯示情境工程小技巧

source: Smileys
zh_hant: 表情

source: Sort
zh_hant: 排序

source: Sort & Filter
zh_hant: 排序與篩選

source: Sort By
zh_hant: 排序方式

source: Specificity
zh_hant: 具體性

source: Stepwise Instructions
zh_hant: 分步指示

source: Structure
zh_hant: 結構

source: Support New Prompts
zh_hant: 支持新提示詞

source: Support for future updates
zh_hant: 支持未來更新

source: Tap to see what's new
zh_hant: 點一下查看新內容

source: Tech Stack
zh_hant: 技術棧

source: Tech Stack (comma-separated, optional)
zh_hant: 技術棧（以逗號分隔，選填）

source: Tip: wrap words in {{double braces}} (e.g. {{topic}}) to make fill-in-the-blank variables.
zh_hant: 小技巧：用 {{雙大括號}} 包住文字（例如 {{topic}}），即可建立填空變數。

source: Title
zh_hant: 標題

source: Try to be a bit more specific about what you want.
zh_hant: 試著更具體地說明你想要什麼。

source: Unfavorite
zh_hant: 移除最愛

source: Upgrade to Premium
zh_hant: 升級至進階版

source: Use every prompt without interruptions.
zh_hant: 使用所有提示詞，不受打擾。

source: Use neutral language to avoid biasing the AI's response.
zh_hant: 使用中立的語言，避免影響 AI 的回答。

source: Vibe Prompts
zh_hant: Vibe 提示詞

source: Vibe Prompts (%lld)
zh_hant: Vibe 提示詞（%lld）

source: Vibe prompts you favorite will appear here
zh_hant: 加入最愛的 Vibe 提示詞會顯示在這裡

source: Vibrate
zh_hant: 震動

source: Welcome, Premium user!
zh_hant: 歡迎，進階版使用者！

source: Writing effective prompts is key to getting the best results from AI models. Here are some best practices, along with the rules our app uses to analyze your prompts:
zh_hant: 撰寫有效的提示詞，是從 AI 模型取得最佳結果的關鍵。以下是一些最佳實踐，以及本 App 分析提示詞時使用的規則：

source: You are now Premium user!
zh_hant: 你已成為進階版使用者！

source: You have no favorite prompts yet. Try all prompts instead?
zh_hant: 你還沒有最愛的提示詞，要改從所有提示詞中挑選嗎？

source: You're All Set!
zh_hant: 一切就緒！

source: Your Name
zh_hant: 你的名字

source: Your purchase funds the new prompts we keep adding to the library.
zh_hant: 你的購買將支持我們持續為資料庫加入新的提示詞。

source: v%@ Check for Updates
zh_hant: v%@ 檢查更新

source: “%@” is copied and ready to paste.
zh_hant: 「%@」已拷貝，可以直接貼上。

source: • Add detail: Clarify who, what, how, when, and where if needed.
zh_hant: • 補充細節：必要時說明誰、什麼、如何、何時、何地。

source: • Add only what the model demonstrably lacks.
zh_hant: • 只補充模型確實缺少的資訊。

source: • Be clear and specific about the app or use case.
zh_hant: • 清楚具體地描述 App 或使用情境。

source: • Be clear and specific about the task.
zh_hant: • 清楚具體地描述任務。

source: • Be specific: Avoid vague words like 'things' or 'stuff'.
zh_hant: • 具體明確：避免使用「東西」、「那些」等模糊字詞。

source: • Break complex tasks into steps.
zh_hant: • 將複雜任務拆成步驟。

source: • Checks for missing details in long prompts.
zh_hant: • 檢查長提示詞是否缺少細節。

source: • Detects repeated or redundant sentences.
zh_hant: • 偵測重複或多餘的句子。

source: • Encourages clear instructions or questions, especially for short prompts.
zh_hant: • 鼓勵使用明確的指令或問題，尤其是短提示詞。

source: • Flags vague or generic wording.
zh_hant: • 標示模糊或籠統的用詞。

source: • Include only necessary information.
zh_hant: • 只包含必要的資訊。

source: • Keep it concise: Remove filler and redundant information.
zh_hant: • 保持簡潔：刪除贅字與多餘資訊。

source: • Looks for examples in long prompts.
zh_hant: • 檢查長提示詞是否包含範例。

source: • Make your prompt a clear instruction or question.
zh_hant: • 讓提示詞成為明確的指令或問題。

source: • Provide examples: Add sample outputs or clarifications.
zh_hant: • 提供範例：加入範例輸出或補充說明。

source: • Prune irrelevant or redundant information.
zh_hant: • 刪除無關或重複的資訊。

source: • Recommends breaking down complex tasks into steps.
zh_hant: • 建議將複雜任務拆成步驟。

source: • Specify output: Indicate the desired format (e.g., JSON, list).
zh_hant: • 指定輸出：說明想要的格式（例如 JSON、清單）。

source: • Start with the fundamental context needed for the task.
zh_hant: • 從任務所需的基本情境開始。

source: • State your audience: Mention if the response should be for beginners, experts, etc.
zh_hant: • 說明目標讀者：註明回答是給初學者、專家或其他對象。

source: • Suggests adding structure for lengthy instructions.
zh_hant: • 建議為冗長的指示加入結構。

source: • Suggests specifying output format and audience.
zh_hant: • 建議指定輸出格式與目標讀者。

source: • Use neutral language: Avoid leading or biased phrases.
zh_hant: • 使用中立語言：避免引導性或帶有偏見的用語。

source: • Use structure (lists, JSON, etc.) for clarity.
zh_hant: • 使用結構（清單、JSON 等）讓內容更清楚。

source: • Use structure: Break complex tasks into steps or lists.
zh_hant: • 使用結構：將複雜任務拆成步驟或清單。

source: • Warns if prompts are too long or contain filler words.
zh_hant: • 提示詞過長或含有贅字時發出提醒。

source: ✍️ Writing
zh_hant: ✍️ 寫作

source: ✨ Enter New Category
zh_hant: ✨ 輸入新分類

source: ✨ General
zh_hant: ✨ 一般

source: ✨ Thanks for unlocking the full experience.
zh_hant: ✨ 感謝你解鎖完整體驗。

source: 🎉 Fun
zh_hant: 🎉 娛樂

source: 💬 All
zh_hant: 💬 全部

source: 💼 Productivity
zh_hant: 💼 生產力

source: 📚 Learning
zh_hant: 📚 學習

source: 🗣️ Conversation
zh_hant: 🗣️ 對話

source: 🤖 AI & Tech
zh_hant: 🤖 AI 與科技

source: 🧠 Creativity
zh_hant: 🧠 創意

source: Privacy
zh_hant: 隱私

source: Privacy Settings
zh_hant: 隱私權設定
